Revit 2027 API
BasicFileInfo.IsCentral Property
 Checks if the file is workshared and Central.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCentral { get; }
Public ReadOnly Property IsCentral As Boolean
	Get
public:
property bool IsCentral {
	bool get ();
}
member IsCentral : bool with get
Property Value
Boolean
See Also
Reference
BasicFileInfo Class
Autodesk.Revit.DB Namespace